src/究竟什么是binding.pry?.org

#+BEGIN_QUOTE
原文链接：http://kyrylo.hatenablog.com/entry/2013/05/29/so-what-is-binding-pry-exactly
#+END_QUOTE

你一定知道"binding.pry"，因为你到处在用并且越用越兴奋。确实，binding.pry能让程序员的日子好过很多，但是你有没有想过"binding.pry"究竟是什么？果然没有。当我第一次看到binding.pry的时候，我觉得它好像是一种不可思议的魔法，但其实这些新鲜的东西并没有我们想的那么玄幻，读完这篇文章，你就会对pry有趣的特性有一个深刻的了解。

** 简单的表达背后的强大力量

   binding.pry可以用在很多地方，比如，我们通过命令行进入Pry的时候默认上下文是"main"。Pry会显示出一个"[1]pry(main)>"，对吧。这玩意儿可以反映出你当前的上下文。
   下面的三个例子在不同的地方插入了binding.pry，因此反应出的上下文是不同的。

   #+BEGIN_SRC ruby
   class Song
     binding.pry # pry(Song)

     def play
       puts 'Ground control to Major Tom...'
     end
   end
   #+END_SRC

   #+BEGIN_SRC ruby
   class Song
     def play
       binding.pry # pry(#<Song>)
       puts 'Ground control to Major Tom...'
     end
   end
   #+END_SRC

   #+BEGIN_SRC ruby
   class Song
     def play
       puts 'Ground control to Major Tom...'
     end
   end

   binding.pry # pry(main)
   #+END_SRC

** "binding"和"pry"
   
   现在让我们来揭开她的神秘面纱。估计有些人知道Ruby中的Binding类，但我猜也有一些人压根没有听过。这并不是每个Ruby程序员都必须知道的那种东西，但"binding.pry"就是它赋予的神力。下面我们详细分析一下。

** "binding"

   "binding"是一个method，是Binding类的对象实例。

   #+BEGIN_SRC ruby
   binding.class #=> Binding
   binding #=> #<Binding:0xa9dcefc>
   binding #=> #<Binding:0xa9ee490>
   #+END_SRC

   因为它是Kernel module中的方法，所以你可以把它用在任何对象身上。需要说明的是，Binding类不能被initialize，binding是产生其对象的唯一入口。

   那么究竟什么是"binding"？binding就像是一个“快照”，这个“快照”记录了当前实例所有可见的的内容，比如：self，本地变量，方法，实例变量等等。你可以把它想像成一个充满了各种东西的房间，这种房间有很多，每一个房间都有自己的小玩意儿和一个窗户。在Pry的间隙这种地方叫做“上下文”，但是现在如果想要从房间中拿到一个东西，我们需要用pry打开这扇窗户，悄悄潜入房间，看一看周围有什么可以顺的。

   多亏了Binding类，这个所谓的窗户可以用一个方法表示，假设我们叫它"Room#window"，我们放进去一个玩具熊，然后我们要再拿出来。

   #+BEGIN_SRC ruby
   class Room
     def initialize
       @items = [:teddy_bear]
     end

     def window
       binding
     end
   end

   backpack = []
   bedroom = Room.new

   bedroom.window.eval('@items') #=> [:teddy_bear]
   backpack << bedroom.window.eval('@items.pop')
   backpack.inspect #=> [:teddy_bear]
   bedroom.window.eval('@items') #=> []
   #+END_SRC

   你还可以让Maria同学把玩具熊放回去，"binding"可以让我们在Maria的上下文中运行Room的代码，于是大家都很满意。
   
   #+BEGIN_SRC ruby
   module Maria
     def self.tack_back(item, from, to)
       eval("@items << #{ from.delete(item).inspect }", to)
     end
   end

   Maria.take_back(:teddy_bear, backpack, bedroom.window)
   backpack.inspect #=> []
   bedroom.window.eval('@items') #=> [:teddy_bear]
   #+END_SRC

