blogs/究竟什么是binding.pry?.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content=" Norris" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge9fdbeb">1. 简单的表达背后的强大力量</a></li>
<li><a href="#org0bf228e">2. "binding"和"pry"</a></li>
<li><a href="#org228bbe5">3. "binding"</a></li>
<li><a href="#org6aa392f">4. "pry"</a></li>
<li><a href="#org5559c71">5. "binding"和"pry"在一起</a></li>
</ul>
</div>
</div>
<blockquote>
<p>
原文链接：<a href="http://kyrylo.hatenablog.com/entry/2013/05/29/so-what-is-binding-pry-exactly">http://kyrylo.hatenablog.com/entry/2013/05/29/so-what-is-binding-pry-exactly</a>
</p>
</blockquote>

<p>
你一定知道"binding.pry"，因为你到处在用并且越用越兴奋。确实，binding.pry能让程序员的日子好过很多，但是你有没有想过"binding.pry"究竟是什么？果然没有。当我第一次看到binding.pry的时候，我觉得它好像是一种不可思议的魔法，但其实这些新鲜的东西并没有我们想的那么玄幻，读完这篇文章，你就会对pry有趣的特性有一个深刻的了解。
</p>

<div id="outline-container-orge9fdbeb" class="outline-2">
<h2 id="orge9fdbeb"><span class="section-number-2">1</span> 简单的表达背后的强大力量</h2>
<div class="outline-text-2" id="text-1">
<p>
binding.pry可以用在很多地方，比如，我们通过命令行进入Pry的时候默认上下文是"main"。Pry会显示出一个"[1]pry(main)&gt;"，对吧。这玩意儿可以反映出你当前的上下文。
下面的三个例子在不同的地方插入了binding.pry，因此反应出的上下文是不同的。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">Song</span>
  <span style="color: #d08770;">binding</span>.pry <span style="color: #c0c5ce;"># </span><span style="color: #65737e;">pry(Song)</span>

  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">play</span>
    <span style="color: #d08770;">puts</span> <span style="color: #a3be8c;">'Ground control to Major Tom...'</span>
  <span style="color: #b48ead;">end</span>
<span style="color: #b48ead;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">Song</span>
  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">play</span>
    <span style="color: #d08770;">binding</span>.pry <span style="color: #c0c5ce;"># </span><span style="color: #65737e;">pry(#&lt;Song&gt;)</span>
    <span style="color: #d08770;">puts</span> <span style="color: #a3be8c;">'Ground control to Major Tom...'</span>
  <span style="color: #b48ead;">end</span>
<span style="color: #b48ead;">end</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">Song</span>
  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">play</span>
    <span style="color: #d08770;">puts</span> <span style="color: #a3be8c;">'Ground control to Major Tom...'</span>
  <span style="color: #b48ead;">end</span>
<span style="color: #b48ead;">end</span>

<span style="color: #d08770;">binding</span>.pry <span style="color: #c0c5ce;"># </span><span style="color: #65737e;">pry(main)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0bf228e" class="outline-2">
<h2 id="org0bf228e"><span class="section-number-2">2</span> "binding"和"pry"</h2>
<div class="outline-text-2" id="text-2">
<p>
现在让我们来揭开她的神秘面纱。估计有些人知道Ruby中的Binding类，但我猜也有一些人压根没有听过。这并不是每个Ruby程序员都必须知道的那种东西，但"binding.pry"就是它赋予的神力。下面我们详细分析一下。
</p>
</div>
</div>

<div id="outline-container-org228bbe5" class="outline-2">
<h2 id="org228bbe5"><span class="section-number-2">3</span> "binding"</h2>
<div class="outline-text-2" id="text-3">
<p>
"binding"是一个method，是Binding类的对象实例。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #d08770;">binding</span>.class <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">=&gt; Binding</span>
<span style="color: #d08770;">binding</span> <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">=&gt; #&lt;Binding:0xa9dcefc&gt;</span>
<span style="color: #d08770;">binding</span> <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">=&gt; #&lt;Binding:0xa9ee490&gt;</span>
</pre>
</div>

<p>
因为它是Kernel module中的方法，所以你可以把它用在任何对象身上。需要说明的是，Binding类不能被initialize，binding是产生其对象的唯一入口。
</p>

<p>
那么究竟什么是"binding"？binding就像是一个“快照”，这个“快照”记录了当前实例所有可见的的内容，比如：self，本地变量，方法，实例变量等等。你可以把它想像成一个充满了各种东西的房间，这种房间有很多，每一个房间都有自己的小玩意儿和一个窗户。在Pry的间隙这种地方叫做“上下文”，但是现在如果想要从房间中拿到一个东西，我们需要用pry打开这扇窗户，悄悄潜入房间，看一看周围有什么可以顺的。
</p>

<p>
多亏了Binding类，这个所谓的窗户可以用一个方法表示，假设我们叫它"Room#window"，我们放进去一个玩具熊，然后我们要再拿出来。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">Room</span>
  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">initialize</span>
    <span style="color: #bf616a;">@items</span> = <span style="color: #8c8c8c;">[</span><span style="color: #d08770;">:teddy_bear</span><span style="color: #8c8c8c;">]</span>
  <span style="color: #b48ead;">end</span>

  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">window</span>
    <span style="color: #d08770;">binding</span>
  <span style="color: #b48ead;">end</span>
<span style="color: #b48ead;">end</span>

backpack = <span style="color: #8c8c8c;">[]</span>
bedroom = <span style="color: #c0c5ce;">Room</span>.new

bedroom.window.eval<span style="color: #8c8c8c;">(</span><span style="color: #a3be8c;">'@items'</span><span style="color: #8c8c8c;">)</span> <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">=&gt; [:teddy_bear]</span>
backpack &lt;&lt; bedroom.window.eval<span style="color: #8c8c8c;">(</span><span style="color: #a3be8c;">'@items.pop'</span><span style="color: #8c8c8c;">)</span>
backpack.inspect <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">=&gt; [:teddy_bear]</span>
bedroom.window.eval<span style="color: #8c8c8c;">(</span><span style="color: #a3be8c;">'@items'</span><span style="color: #8c8c8c;">)</span> <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">=&gt; []</span>
</pre>
</div>

<p>
你还可以让Maria同学把玩具熊放回去，"binding"可以让我们在Maria的上下文中运行Room的代码，于是大家都很满意。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b48ead;">module</span> <span style="color: #c0c5ce;">Maria</span>
  <span style="color: #b48ead;">def</span> <span style="color: #b48ead;">self</span>.<span style="color: #8fa1b3;">tack_back</span><span style="color: #8c8c8c;">(</span>item, from, to<span style="color: #8c8c8c;">)</span>
    <span style="color: #d08770;">eval</span><span style="color: #8c8c8c;">(</span><span style="color: #a3be8c;">"@items &lt;&lt; </span><span style="color: #bf616a;">#{ from.delete(item).inspect }</span><span style="color: #a3be8c;">"</span>, to<span style="color: #8c8c8c;">)</span>
  <span style="color: #b48ead;">end</span>
<span style="color: #b48ead;">end</span>

<span style="color: #c0c5ce;">Maria</span>.take_back<span style="color: #8c8c8c;">(</span><span style="color: #d08770;">:teddy_bear</span>, backpack, bedroom.window<span style="color: #8c8c8c;">)</span>
backpack.inspect <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">=&gt; []</span>
bedroom.window.eval<span style="color: #8c8c8c;">(</span><span style="color: #a3be8c;">'@items'</span><span style="color: #8c8c8c;">)</span> <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">=&gt; [:teddy_bear]</span>
</pre>
</div>
</div>
</div>
