src/究竟什么是binding.pry?.org
** "pry"

   下面来看另一半，"pry"。实际上任何Ruby对象都可以调用pry方法，因为它是定义在Object类中的，而Object类是所有Ruby类的祖先。这个方法会针对当前对象的上下文开启一个“pry”的会话。

   #+BEGIN_SRC ruby
   [1] pry(main)> ['andrew', 'alexander', 'vladimir'].pry
   [1] pry(#<Array>)> map &:capitalize
   => ["Andrew", "Alexander", "Vladimir"]
   [2] pry(#<Array>)> exit
   => nil
   [2] pry(main)> "do you hear me?".pry
   [1] pry("do you hear me?")> upcase
   => "DO YOU HEAR ME?"
   [2] pry("do you hear me?")> exit
   => nil
   [3] pry(main)>
   #+END_SRC

   你可能还记得文章刚开始的例子，看到这里你可能会想：我们能不能直接把"binding"去掉，就写"pry"行不行。行啊。但是你在哪个对象的身上开启这个pry会话呢，"binding.pry"和"pry"不能互换，因为他们针对的上下文是不一样的。

   下面这个例子用了"binding.pry"，在Song对象上创建了一个Pry会话，然后我们可以获取到"music"的值。

   #+BEGIN_SRC ruby
   class Song
     def play
       music = 'rock & roll'
       "I love #{ binding.pry }"
     end
   end

   Song.new.play
   #+END_SRC

   #+BEGIN_SRC ruby
   [1] pry(#<Song>)> music
   => "rock & roll"
   #+END_SRC

   然后我们稍微改一下"Song#play"这个方法，我们用"pry"替换掉"binding.pry"，于是又一次在Song对象上创建了一个Pry会话，但这次有点奇怪，居然拿不到"music"！虽然我们在"Song#play"方法中调用了pry，但Pry的"read-eval-print"(REPL)循环并没有像我们想的那样执行，这是因为pry并没有作用在"Song#play"方法的binding窗口上，而是直接作用在了对象上，相当于"self.pry"。

   #+BEGIN_SRC ruby
   class Song
     def play
       music = 'rock & roll'
       "I love #{pry}"
     end
   end

   song = Song.new #=> #<Song:0x9d89588>
   $old_id = song.object_id #=> 82594500
   song.play
   #+END_SRC

   #+BEGIN_SRC ruby
   [1] pry(#<Song>)> music
   NameError: undefined local variable or method `music` for #<Song:0xbd2fe00> from (pry):7:in `__pry__`
   [2] pry(#<Song>)> whereami
   Inside #<Song>.
   [3] pry(#<Song>)> object_id == $old_id
   => true
   #+END_SRC

   "self"从Object类中继承了"pry"方法(不是真正的继承，毕竟它只是一个Ruby对象的placeholder)。所以"self.pry"和"pry"是一回事。

   有一个小问题需要说明一下，由于Pry不是BasicObject对象，而BasicObject是Object的超类，在祖先链中高于Object，这意味着BasicObject对象中并没有pry方法，所以你不能在它上面调用pry。我们也不能把pry方法单纯的移到BasicObject中，因为里面并没有"binding"方法。

   #+BEGIN_SRC ruby
   basic = BasicObject.new #=> #<BasicObject:0x512c30c>
   basic.pry #=> NoMethodError: undefined method `pry` for #<BasicObject:0xa258618>
   #+END_SRC

   按照Ruby的设计，"binding"取自于Kernel module，Object是它唯一的类。有些人希望"binding"同样支持BasicObject，但目前看来这不会发生。有一些这方面的努力，但没有什么实质性的进展。

   虽然Pry不支持BasicObject的对象，但支持BasicObject类，因为类没有binding.

   #+BEGIN_SRC ruby
   [1] pry(main)> BasicObject.pry
   [1] pry(BasicObject)> __id__
   => 81839890
   #+END_SRC

   pry另外一个有趣的特性是它支持参数，所以pry, self.pry, pry(self)是一样的。除了self之外，pry也支持其他Ruby的对象作为参数。惊喜吧，这么一个方法被赋予了多大的力量！

   看下面的例子，"pry"并不像"cd"那样，它不会保存一个bindings的链（或者bindings栈），而是每次都会创建一个新的会话，包含一个只属于自己的bindings栈（看下面的[1]，后面的标记并没有延续之前的，而是在不改变已有标记的前提下创建一个新的）

   #+BEGIN_SRC ruby
   [1] pry(main)> pry 1337
   [1] pry(1337) pry ''
   [1] pry("") pry :awesome!
   [1] pry(:awesome!)>
   [1] pry(:awesome!) nesting
   Nesting status:
   --
   0. :awesome! (Pry top level)
   [2] pry(:awesome!)> exit
   => nil
   [1] pry("")> nesting
   Nesting status:
   --
   0. "" (Pry top level)
   #+END_SRC

   "pry"方法还支持第二个参数：hash options。虽然你一般不会需要这个参数，但是多知道一些对你没坏处。你可以在"pry_instance.rb"文件中找到一份options列表，不过列表有点大。下面只介绍两个有意思的option：":output"和":extra_sticky_locals"。

   下面的例子中做了几件事情。首先我把所有Pry会话输出的内容都重定向到了一个叫"output_history"的变量上，这样就可以打印输出这些内容了，然后，我插入了一个粘性局部变量，它可以在所有的Pry会话中访问到并且共享数据。需要知道的是，每当一个新的Pry会话创建之后，hash options并不会影响之前的会话，只在当前的会话中有效。

   #+BEGIN_SRC ruby
   [1] pry(main)> output_history = StringhIO.new
   => #<StringIO:0xab8978c>
   [2] pry(main)> :universe.pry :output => output_history, :extra_sticky_locals => { :time => Time.now }
   [1] pry(:universe)> whereami
   [2] pry(:universe)> ls
   [3] pry(:universe)> time
   [4] pry(:universe)> Help me out!
   [5] pry(:universe)> exit
   => nil
   [3] pry(main)> puts output_history.string
   Inside :universe.
   Comparable#methods: <  <=  >  >=  between?
   Symbol#methods: 
     <=>  =~       capitalize  empty?    inspect  match               size   swapcase  to_sym
     ==   []       casecmp     encoding  intern   next                slice  to_proc   upcase
     ===  __pry__  downcase    id2name   length   pretty_print_cycle  succ   to_s    
   locals: _  __  _dir_  _ex_  _file_  _in_  _out_  _pry_  time
   => 2013-05-25 14:22:34 +0300
   NoMethodError: undefined method `out!' for :universe:Symbol
   from (pry):3:in `__pry__'
   => nil
   [4] pry(main)> time
   NameError: undefined local variable or method `time' for main:Object
   from (pry):8:in `__pry__'
   #+END_SRC
   
