blogs/究竟什么是binding.pry?.html

<div id="outline-container-org6aa392f" class="outline-2">
<h2 id="org6aa392f"><span class="section-number-2">4</span> "pry"</h2>
<div class="outline-text-2" id="text-4">
<p>
下面来看另一半，"pry"。实际上任何Ruby对象都可以调用pry方法，因为它是定义在Object类中的，而Object类是所有Ruby类的祖先。这个方法会针对当前对象的上下文开启一个“pry”的会话。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span>main<span style="color: #8c8c8c;">)</span>&gt; <span style="color: #8c8c8c;">[</span><span style="color: #a3be8c;">'andrew'</span>, <span style="color: #a3be8c;">'alexander'</span>, <span style="color: #a3be8c;">'vladimir'</span><span style="color: #8c8c8c;">]</span>.pry
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span><span style="color: #c0c5ce;">#</span><span style="color: #65737e;">&lt;Array&gt;)&gt; map &amp;:capitalize</span>
=&gt; <span style="color: #93a8c6;">[</span><span style="color: #a3be8c;">"Andrew"</span>, <span style="color: #a3be8c;">"Alexander"</span>, <span style="color: #a3be8c;">"Vladimir"</span><span style="color: #93a8c6;">]</span>
<span style="color: #93a8c6;">[</span><span style="color: #d08770;">2</span><span style="color: #93a8c6;">]</span> pry<span style="color: #93a8c6;">(</span><span style="color: #c0c5ce;">#</span><span style="color: #65737e;">&lt;Array&gt;)&gt; exit</span>
=&gt; <span style="color: #d08770;">nil</span>
<span style="color: #b0b1a3;">[</span><span style="color: #d08770;">2</span><span style="color: #b0b1a3;">]</span> pry<span style="color: #b0b1a3;">(</span>main<span style="color: #b0b1a3;">)</span>&gt; <span style="color: #a3be8c;">"do you hear me?"</span>.pry
<span style="color: #b0b1a3;">[</span><span style="color: #d08770;">1</span><span style="color: #b0b1a3;">]</span> pry<span style="color: #b0b1a3;">(</span><span style="color: #a3be8c;">"do you hear me?"</span><span style="color: #b0b1a3;">)</span>&gt; upcase
=&gt; <span style="color: #a3be8c;">"DO YOU HEAR ME?"</span>
<span style="color: #b0b1a3;">[</span><span style="color: #d08770;">2</span><span style="color: #b0b1a3;">]</span> pry<span style="color: #b0b1a3;">(</span><span style="color: #a3be8c;">"do you hear me?"</span><span style="color: #b0b1a3;">)</span>&gt; <span style="color: #d08770;">exit</span>
=&gt; <span style="color: #d08770;">nil</span>
<span style="color: #b0b1a3;">[</span><span style="color: #d08770;">3</span><span style="color: #b0b1a3;">]</span> pry<span style="color: #b0b1a3;">(</span>main<span style="color: #b0b1a3;">)</span>&gt;
</pre>
</div>

<p>
你可能还记得文章刚开始的例子，看到这里你可能会想：我们能不能直接把"binding"去掉，就写"pry"行不行。行啊。但是你在哪个对象的身上开启这个pry会话呢，"binding.pry"和"pry"不能互换，因为他们针对的上下文是不一样的。
</p>

<p>
下面这个例子用了"binding.pry"，在Song对象上创建了一个Pry会话，然后我们可以获取到"music"的值。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">Song</span>
  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">play</span>
    music = <span style="color: #a3be8c;">'rock &amp; roll'</span>
    <span style="color: #a3be8c;">"I love </span><span style="color: #bf616a;">#{ binding.pry }</span><span style="color: #a3be8c;">"</span>
  <span style="color: #b48ead;">end</span>
<span style="color: #b48ead;">end</span>

<span style="color: #c0c5ce;">Song</span>.new.play
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span><span style="color: #c0c5ce;">#</span><span style="color: #65737e;">&lt;Song&gt;)&gt; music</span>
=&gt; <span style="color: #a3be8c;">"rock &amp; roll"</span>
</pre>
</div>

<p>
然后我们稍微改一下"Song#play"这个方法，我们用"pry"替换掉"binding.pry"，于是又一次在Song对象上创建了一个Pry会话，但这次有点奇怪，居然拿不到"music"！虽然我们在"Song#play"方法中调用了pry，但Pry的"read-eval-print"(REPL)循环并没有像我们想的那样执行，这是因为pry并没有作用在"Song#play"方法的binding窗口上，而是直接作用在了对象上，相当于"self.pry"。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b48ead;">class</span> <span style="color: #c0c5ce;">Song</span>
  <span style="color: #b48ead;">def</span> <span style="color: #8fa1b3;">play</span>
    music = <span style="color: #a3be8c;">'rock &amp; roll'</span>
    <span style="color: #a3be8c;">"I love </span><span style="color: #bf616a;">#{pry}</span><span style="color: #a3be8c;">"</span>
  <span style="color: #b48ead;">end</span>
<span style="color: #b48ead;">end</span>

song = <span style="color: #c0c5ce;">Song</span>.new <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">=&gt; #&lt;Song:0x9d89588&gt;</span>
<span style="color: #bf616a;">$old_id</span> = song.object_id <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">=&gt; 82594500</span>
song.play
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span><span style="color: #c0c5ce;">#</span><span style="color: #65737e;">&lt;Song&gt;)&gt; music</span>
<span style="color: #c0c5ce;">NameError</span>: undefined local variable <span style="color: #b48ead;">or</span> method <span style="color: #a3be8c;">`music`</span> <span style="color: #b48ead;">for</span> <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">&lt;Song:0xbd2fe00&gt; from (pry):7:in `__pry__`</span>
<span style="color: #93a8c6;">[</span><span style="color: #d08770;">2</span><span style="color: #93a8c6;">]</span> pry<span style="color: #93a8c6;">(</span><span style="color: #c0c5ce;">#</span><span style="color: #65737e;">&lt;Song&gt;)&gt; whereami</span>
<span style="color: #c0c5ce;">Inside</span> <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">&lt;Song&gt;.</span>
<span style="color: #b0b1a3;">[</span><span style="color: #d08770;">3</span><span style="color: #b0b1a3;">]</span> pry<span style="color: #b0b1a3;">(</span><span style="color: #c0c5ce;">#</span><span style="color: #65737e;">&lt;Song&gt;)&gt; object_id == $old_id</span>
=&gt; <span style="color: #d08770;">true</span>
</pre>
</div>

<p>
"self"从Object类中继承了"pry"方法(不是真正的继承，毕竟它只是一个Ruby对象的placeholder)。所以"self.pry"和"pry"是一回事。
</p>

<p>
有一个小问题需要说明一下，由于Pry不是BasicObject对象，而BasicObject是Object的超类，在祖先链中高于Object，这意味着BasicObject对象中并没有pry方法，所以你不能在它上面调用pry。我们也不能把pry方法单纯的移到BasicObject中，因为里面并没有"binding"方法。
</p>

<div class="org-src-container">
<pre class="src src-ruby">basic = <span style="color: #c0c5ce;">BasicObject</span>.new <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">=&gt; #&lt;BasicObject:0x512c30c&gt;</span>
basic.pry <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">=&gt; NoMethodError: undefined method `pry` for #&lt;BasicObject:0xa258618&gt;</span>
</pre>
</div>

<p>
按照Ruby的设计，"binding"取自于Kernel module，Object是它唯一的类。有些人希望"binding"同样支持BasicObject，但目前看来这不会发生。有一些这方面的努力，但没有什么实质性的进展。
</p>

<p>
虽然Pry不支持BasicObject的对象，但支持BasicObject类，因为类没有binding.
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span>main<span style="color: #8c8c8c;">)</span>&gt; <span style="color: #c0c5ce;">BasicObject</span>.pry
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span><span style="color: #c0c5ce;">BasicObject</span><span style="color: #8c8c8c;">)</span>&gt; __id__
=&gt; <span style="color: #d08770;">81839890</span>
</pre>
</div>

<p>
pry另外一个有趣的特性是它支持参数，所以pry, self.pry, pry(self)是一样的。除了self之外，pry也支持其他Ruby的对象作为参数。惊喜吧，这么一个方法被赋予了多大的力量！
</p>

<p>
看下面的例子，"pry"并不像"cd"那样，它不会保存一个bindings的链（或者bindings栈），而是每次都会创建一个新的会话，包含一个只属于自己的bindings栈（看下面的[1]，后面的标记并没有延续之前的，而是在不改变已有标记的前提下创建一个新的）
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span>main<span style="color: #8c8c8c;">)</span>&gt; pry <span style="color: #d08770;">1337</span>
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span><span style="color: #d08770;">1337</span><span style="color: #8c8c8c;">)</span> pry <span style="color: #a3be8c;">''</span>
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span><span style="color: #a3be8c;">""</span><span style="color: #8c8c8c;">)</span> pry <span style="color: #d08770;">:awesome!</span>
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span><span style="color: #d08770;">:awesome!</span><span style="color: #8c8c8c;">)</span>&gt;
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span><span style="color: #d08770;">:awesome!</span><span style="color: #8c8c8c;">)</span> nesting
<span style="color: #c0c5ce;">Nesting</span> <span style="color: #d08770;">status:</span>
--
<span style="color: #d08770;">0</span>. <span style="color: #d08770;">:awesome!</span> <span style="color: #8c8c8c;">(</span><span style="color: #c0c5ce;">Pry</span> top level<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">2</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span><span style="color: #d08770;">:awesome!</span><span style="color: #8c8c8c;">)</span>&gt; <span style="color: #d08770;">exit</span>
=&gt; <span style="color: #d08770;">nil</span>
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span><span style="color: #a3be8c;">""</span><span style="color: #8c8c8c;">)</span>&gt; nesting
<span style="color: #c0c5ce;">Nesting</span> <span style="color: #d08770;">status:</span>
--
<span style="color: #d08770;">0</span>. <span style="color: #a3be8c;">""</span> <span style="color: #8c8c8c;">(</span><span style="color: #c0c5ce;">Pry</span> top level<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
"pry"方法还支持第二个参数：hash options。虽然你一般不会需要这个参数，但是多知道一些对你没坏处。你可以在"pry<sub>instance.rb</sub>"文件中找到一份options列表，不过列表有点大。下面只介绍两个有意思的option：":output"和":extra<sub>sticky</sub><sub>locals</sub>"。
</p>

<p>
下面的例子中做了几件事情。首先我把所有Pry会话输出的内容都重定向到了一个叫"output<sub>history</sub>"的变量上，这样就可以打印输出这些内容了，然后，我插入了一个粘性局部变量，它可以在所有的Pry会话中访问到并且共享数据。需要知道的是，每当一个新的Pry会话创建之后，hash options并不会影响之前的会话，只在当前的会话中有效。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span>main<span style="color: #8c8c8c;">)</span>&gt; output_history = <span style="color: #c0c5ce;">StringhIO</span>.new
=&gt; <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">&lt;StringIO:0xab8978c&gt;</span>
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">2</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span>main<span style="color: #8c8c8c;">)</span>&gt; <span style="color: #d08770;">:universe</span>.pry <span style="color: #d08770;">:output</span> =&gt; output_history, <span style="color: #d08770;">:extra_sticky_locals</span> =&gt; <span style="color: #8c8c8c;">{</span> <span style="color: #d08770;">:time</span> =&gt; <span style="color: #c0c5ce;">Time</span>.now <span style="color: #8c8c8c;">}</span>
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span><span style="color: #d08770;">:universe</span><span style="color: #8c8c8c;">)</span>&gt; whereami
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">2</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span><span style="color: #d08770;">:universe</span><span style="color: #8c8c8c;">)</span>&gt; ls
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">3</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span><span style="color: #d08770;">:universe</span><span style="color: #8c8c8c;">)</span>&gt; time
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">4</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span><span style="color: #d08770;">:universe</span><span style="color: #8c8c8c;">)</span>&gt; <span style="color: #c0c5ce;">Help</span> me out!
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">5</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span><span style="color: #d08770;">:universe</span><span style="color: #8c8c8c;">)</span>&gt; <span style="color: #d08770;">exit</span>
=&gt; <span style="color: #d08770;">nil</span>
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">3</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span>main<span style="color: #8c8c8c;">)</span>&gt; <span style="color: #d08770;">puts</span> output_history.string
<span style="color: #c0c5ce;">Inside</span> <span style="color: #d08770;">:universe</span>.
<span style="color: #c0c5ce;">Comparable</span><span style="color: #c0c5ce;">#</span><span style="color: #65737e;">methods: &lt;  &lt;=  &gt;  &gt;=  between?</span>
<span style="color: #c0c5ce;">Symbol</span><span style="color: #c0c5ce;">#</span><span style="color: #65737e;">methods: </span>
  &lt;=&gt;  =~       capitalize  empty?    inspect  match               size   swapcase  to_sym
  ==   <span style="color: #8c8c8c;">[]</span>       casecmp     encoding  intern   <span style="color: #b48ead;">next</span>                slice  to_proc   upcase
  ===  __pry__  downcase    id2name   length   pretty_print_cycle  succ   to_s    
<span style="color: #d08770;">locals:</span> _  __  _dir_  _ex_  _file_  _in_  _out_  _pry_  time
=&gt; <span style="color: #d08770;">2013</span>-<span style="color: #d08770;">05</span>-<span style="color: #d08770;">25</span> <span style="color: #d08770;">14</span>:<span style="color: #d08770;">22</span>:<span style="color: #d08770;">34</span> +<span style="color: #d08770;">0300</span>
<span style="color: #c0c5ce;">NoMethodError</span>: undefined method <span style="color: #a3be8c;">`out!' for :universe:Symbol</span>
<span style="color: #a3be8c;">from (pry):3:in `</span>__pry__<span style="color: #a3be8c;">'</span>
<span style="color: #a3be8c;">=&gt; nil</span>
<span style="color: #a3be8c;">[4] pry(main)&gt; time</span>
<span style="color: #a3be8c;">NameError: undefined local variable or method `time'</span> <span style="color: #b48ead;">for</span> main<span style="color: #d08770;">:Object</span>
from <span style="color: #8c8c8c;">(</span>pry<span style="color: #8c8c8c;">)</span>:<span style="color: #d08770;">8</span>:in <span style="color: #a3be8c;">`__pry__'</span>
</pre>
</div>
</div>
</div>
