src/究竟什么是binding.pry?.org
** "binding"和"pry"在一起
   
   现在你已经基本了解"binding"和"pry"，那么问题来了。Pry怎么知道在哪开始一次read-eval-print-loop？"binding.pry"为什么会起作用？简单来说， 当你在一个对象上调用pry的时候，Pry获取这个对象的binding并且开始执行一次REPL。获取binding的方法十分简单，叫做"Pry.binding_for".

   #+BEGIN_SRC ruby
   b = Pry.binding_for(:universe) #=> #<Binding:0xb2e7ad8>
   b.eval('self') #=> :universe
   #+END_SRC

   可以传递任何的Ruby对象，如果穿了一个Binding对象或者最高级的binding，会直接返回，但如果是其他的参数，比如":universe"，就会调用__binding__方法并且返回相关的binding。那么:universe为什么能调用这个方法呢，因为它也定义在Object中。

   还有一个方法也可以用来调取binding，"__pry__"，这个方法会在对象调用"pry"的时候创建。

   #+BEGIN_SRC ruby
   [1] pry(main)> :universe.__pry__
   NoMethodError: undefined method `__pry__' for :universe:Symbol
   from (pry):1:in `__pry__'
   [2] pry(main)> :universe.pry
   [1] pry(:universe)> :universe.__pry__
   => #<Binding:0xadf1a74>
   [2] pry(:universe)> 
   => nil
   [3] pry(main)> :universe.__pry__
   => #<Binding:0x91a27c4>
   [4] pry(main)> :universe.__pry__.eval('self')
   => :universe
   #+END_SRC

   不难理解，它只是获取了一个对象的binding(想象"Room@window"，"__pry__"是一样的)。虽然这个方法用得不那么多，但可以做一些有意思的事情。比如，一旦"__pry__"被定义了，你就可以获取对象内部的东西而不用再次进入pry会话。

   #+BEGIN_SRC ruby
   [1] pry(main)> 1337.pry
   [1] pry(1337)> @leet_number = :so_leet
   => :so_leet
   [2] pry(1337)> exit
   => nil
   [2] pry(main)> 1337.__pry__.eval('@leet_number')
   => :so_leet
   #+END_SRC
   
   还有，Pry会给所有对象声明一个"__binding__"方法，这个方法从一开始就已经有了，所以你也不用调用pry了。

   #+BEGIN_SRC ruby
   [1] pry(main)> :universe.__binding__.eval 'upcase'
   => :UNIVERSE
   #+END_SRC

   为什么看起来一模一样的方法要弄两个。因为——它们不一样。"__pry__"比"__binding__"更底层，"__binding__"调用了"__pry__"，因此"__binding__"更强大一些，所有的类和模块中并没有"__pry__"方法，但都有"__binding__"。还记得Pry可以在一个类的上下文中开启一个会话吗，就是"__binding__"干的。

   #+BEGIN_SRC ruby
   A = Class.new
   A.__pry__ #=> NoMethodError
   A.__binding__ #=> #<Binding:0xb0e8570>
   
   A.pry
   exit # Exits from the nested session.
   A.__pry__ #=> NoMethodError, still undefined.
   #+END_SRC

   所以"__pry__"针对对象，其他的就要靠"__binding__"了，eval的时候，上下文是"self"。
   
   #+BEGIN_SRC ruby
   [1] pry(main)> M = Module.new
   => M
   [2] pry(main)> M.__binding__.eval('def magnifico; :splendid end')
   => nil
   [3] pry(main)> include M
   => Object
   [4] pry(main)> magnifico
   => :splendid
   #+END_SRC

   就是这样了，想象一个上下文，想象一个REPL，然后合在一起。

   #+BEGIN_SRC ruby
   [1] pry(main)> loop do
                |   print '>> '
                |   puts "=> #{ TOPLEVEL_BINDING.eval(gets) }"
                | end
   >> def hello; :hi end
   =>
   >> hello
   => hi
   #+END_SRC

   现在，给你的代码用上bindings来好好的装一把。
