blogs/究竟什么是binding.pry?.html

<div id="outline-container-org5559c71" class="outline-2">
<h2 id="org5559c71"><span class="section-number-2">5</span> "binding"和"pry"在一起</h2>
<div class="outline-text-2" id="text-5">
<p>
现在你已经基本了解"binding"和"pry"，那么问题来了。Pry怎么知道在哪开始一次read-eval-print-loop？"binding.pry"为什么会起作用？简单来说， 当你在一个对象上调用pry的时候，Pry获取这个对象的binding并且开始执行一次REPL。获取binding的方法十分简单，叫做"Pry.binding<sub>for</sub>".
</p>

<div class="org-src-container">
<pre class="src src-ruby">b = <span style="color: #c0c5ce;">Pry</span>.binding_for<span style="color: #8c8c8c;">(</span><span style="color: #d08770;">:universe</span><span style="color: #8c8c8c;">)</span> <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">=&gt; #&lt;Binding:0xb2e7ad8&gt;</span>
b.eval<span style="color: #8c8c8c;">(</span><span style="color: #a3be8c;">'self'</span><span style="color: #8c8c8c;">)</span> <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">=&gt; :universe</span>
</pre>
</div>

<p>
可以传递任何的Ruby对象，如果穿了一个Binding对象或者最高级的binding，会直接返回，但如果是其他的参数，比如":universe"，就会调用_<sub>binding</sub>_<sub>方法并且返回相关的binding</sub>。那么:universe为什么能调用这个方法呢，因为它也定义在Object中。
</p>

<p>
还有一个方法也可以用来调取binding，"<span class="underline"><span class="underline">pry</span></span>"，这个方法会在对象调用"pry"的时候创建。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span>main<span style="color: #8c8c8c;">)</span>&gt; <span style="color: #d08770;">:universe</span>.__pry__
<span style="color: #c0c5ce;">NoMethodError</span>: undefined method <span style="color: #a3be8c;">`__pry__' for :universe:Symbol</span>
<span style="color: #a3be8c;">from (pry):1:in `</span>__pry__<span style="color: #a3be8c;">'</span>
<span style="color: #a3be8c;">[2] pry(main)&gt; :universe.pry</span>
<span style="color: #a3be8c;">[1] pry(:universe)&gt; :universe.__pry__</span>
<span style="color: #a3be8c;">=&gt; #&lt;Binding:0xadf1a74&gt;</span>
<span style="color: #a3be8c;">[2] pry(:universe)&gt; </span>
<span style="color: #a3be8c;">=&gt; nil</span>
<span style="color: #a3be8c;">[3] pry(main)&gt; :universe.__pry__</span>
<span style="color: #a3be8c;">=&gt; #&lt;Binding:0x91a27c4&gt;</span>
<span style="color: #a3be8c;">[4] pry(main)&gt; :universe.__pry__.eval('</span><span style="color: #b48ead;">self</span><span style="color: #a3be8c;">')</span>
<span style="color: #a3be8c;">=&gt; :universe</span>
</pre>
</div>

<p>
不难理解，它只是获取了一个对象的binding(想象"Room@window"，"<span class="underline"><span class="underline">pry</span></span>"是一样的)。虽然这个方法用得不那么多，但可以做一些有意思的事情。比如，一旦"<span class="underline"><span class="underline">pry</span></span>"被定义了，你就可以获取对象内部的东西而不用再次进入pry会话。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span>main<span style="color: #8c8c8c;">)</span>&gt; <span style="color: #d08770;">1337</span>.pry
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span><span style="color: #d08770;">1337</span><span style="color: #8c8c8c;">)</span>&gt; <span style="color: #bf616a;">@leet_number</span> = <span style="color: #d08770;">:so_leet</span>
=&gt; <span style="color: #d08770;">:so_leet</span>
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">2</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span><span style="color: #d08770;">1337</span><span style="color: #8c8c8c;">)</span>&gt; <span style="color: #d08770;">exit</span>
=&gt; <span style="color: #d08770;">nil</span>
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">2</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span>main<span style="color: #8c8c8c;">)</span>&gt; <span style="color: #d08770;">1337</span>.__pry__.eval<span style="color: #8c8c8c;">(</span><span style="color: #a3be8c;">'@leet_number'</span><span style="color: #8c8c8c;">)</span>
=&gt; <span style="color: #d08770;">:so_leet</span>
</pre>
</div>

<p>
还有，Pry会给所有对象声明一个"<span class="underline"><span class="underline">binding</span></span>"方法，这个方法从一开始就已经有了，所以你也不用调用pry了。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span>main<span style="color: #8c8c8c;">)</span>&gt; <span style="color: #d08770;">:universe</span>.__binding__.eval <span style="color: #a3be8c;">'upcase'</span>
=&gt; <span style="color: #d08770;">:UNIVERSE</span>
</pre>
</div>

<p>
为什么看起来一模一样的方法要弄两个。因为——它们不一样。"<span class="underline"><span class="underline">pry</span></span>"比"<span class="underline"><span class="underline">binding</span></span>"更底层，"<span class="underline"><span class="underline">binding</span></span>"调用了"<span class="underline"><span class="underline">pry</span></span>"，因此"<span class="underline"><span class="underline">binding</span></span>"更强大一些，所有的类和模块中并没有"<span class="underline"><span class="underline">pry</span></span>"方法，但都有"<span class="underline"><span class="underline">binding</span></span>"。还记得Pry可以在一个类的上下文中开启一个会话吗，就是"<span class="underline"><span class="underline">binding</span></span>"干的。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #c0c5ce;">A</span> = <span style="color: #c0c5ce;">Class</span>.new
<span style="color: #c0c5ce;">A</span>.__pry__ <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">=&gt; NoMethodError</span>
<span style="color: #c0c5ce;">A</span>.__binding__ <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">=&gt; #&lt;Binding:0xb0e8570&gt;</span>

<span style="color: #c0c5ce;">A</span>.pry
<span style="color: #d08770;">exit</span> <span style="color: #c0c5ce;"># </span><span style="color: #65737e;">Exits from the nested session.</span>
<span style="color: #c0c5ce;">A</span>.__pry__ <span style="color: #c0c5ce;">#</span><span style="color: #65737e;">=&gt; NoMethodError, still undefined.</span>
</pre>
</div>

<p>
所以"<span class="underline"><span class="underline">pry</span></span>"针对对象，其他的就要靠"<span class="underline"><span class="underline">binding</span></span>"了，eval的时候，上下文是"self"。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span>main<span style="color: #8c8c8c;">)</span>&gt; <span style="color: #c0c5ce;">M</span> = <span style="color: #c0c5ce;">Module</span>.new
=&gt; <span style="color: #c0c5ce;">M</span>
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">2</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span>main<span style="color: #8c8c8c;">)</span>&gt; <span style="color: #c0c5ce;">M</span>.__binding__.eval<span style="color: #8c8c8c;">(</span><span style="color: #a3be8c;">'def magnifico; :splendid end'</span><span style="color: #8c8c8c;">)</span>
=&gt; <span style="color: #d08770;">nil</span>
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">3</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span>main<span style="color: #8c8c8c;">)</span>&gt; <span style="color: #d08770;">include</span> <span style="color: #c0c5ce;">M</span>
=&gt; <span style="color: #c0c5ce;">Object</span>
<span style="color: #8c8c8c;">[</span><span style="color: #d08770;">4</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span>main<span style="color: #8c8c8c;">)</span>&gt; magnifico
=&gt; <span style="color: #d08770;">:splendid</span>
</pre>
</div>

<p>
就是这样了，想象一个上下文，想象一个REPL，然后合在一起。
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #8c8c8c;">[</span><span style="color: #d08770;">1</span><span style="color: #8c8c8c;">]</span> pry<span style="color: #8c8c8c;">(</span>main<span style="color: #8c8c8c;">)</span>&gt; <span style="color: #d08770;">loop</span> <span style="color: #b48ead;">do</span>
             |   <span style="color: #d08770;">print</span> <span style="color: #a3be8c;">'&gt;&gt; '</span>
             |   <span style="color: #d08770;">puts</span> <span style="color: #a3be8c;">"=&gt; </span><span style="color: #bf616a;">#{ TOPLEVEL_BINDING.eval(gets) }</span><span style="color: #a3be8c;">"</span>
             | <span style="color: #b48ead;">end</span>
&gt;&gt; <span style="color: #b48ead;">def</span> hello; <span style="color: #d08770;">:hi</span> <span style="color: #b48ead;">end</span>
=&gt;
&gt;&gt; hello
=&gt; hi
</pre>
</div>

<p>
现在，给你的代码用上bindings来好好的装一把。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

<div>
<p class="author">Author: <a href="https://gitlab.com/jgkamat/jgkamat.gitlab.io"> Norris</a></p>
<p class="date">Published: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="https://orgmode.org">Org</a> mode 9.1.13)</p>
</div>
</div>
</body>
</html>
